app/controllers/products_controller.rb

  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save
---
INSERT INTO "products" ("brand", "category", "created_at", "description", "price", "subcategory", "title", "unit", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)